# encoding: utf-8
namespace :shang_han_lun do
  desc "create a book for shang han lun."
  task :install => :environment do |task, args|
    Book.gen(title:'康平本伤寒论') do
      chapter title:'全一卷' do
        article title:'伤寒卒病论' do

        end
        article title:'伤寒例'
        article title:'辨大阳病痉湿喝'
        article title:'辨大阳病' do
          text %q{
* __大阳之为病，脉浮，头项强痛而恶寒。__
* __大阳病，发热汗出恶风，脉缓者，名为中风。__
* __大阳病，或已发热，或未发热，必恶寒体痛、呕逆，脉阴阳俱紧者，名曰伤寒。__
    + 伤寒一日，大阳受之，脉若静者，为不传。颇欲吐，若躁烦，脉数急者，为传也。
    + 伤寒二三日，阳明少阳证不见者，为不传也。
* __大阳病，发热而渴，不恶寒者，为温病。__
* 若发汗已，身灼热者，名风温。
* __风温为病，脉阴阳俱浮，自汗出，身重，多眠睡，鼻息必鼾，语言难出。__
* 若被下者，小便不利，直视失溲，若被火者，微发黄色，剧则如惊癎，时瘈瘲。若火熏之，一逆尚引日，再逆促命期。
    + 病有发热恶寒者，发于阳也，无热恶寒者，发于阴也，发于阳者，七日愈，发于阴者，六日愈，以阳数七，阴数六故也。
    + 大阳病，头痛至七日以上自愈者，以行尽其经故也。若欲作再经者，针足阳明使经不传则愈。
    + 大阳病，欲解时，从巳至未上。
    + 风家表解，而不了了者，十二日愈。
* __病人身大热，反欲得衣者，热在皮肤，寒在骨髓也；身大寒，反不欲近衣者，寒在皮肤，热在骨髓也。__
* __大阳中风，脉阳浮而阴弱^[阳浮者，热自发，阴弱者，汗自出]，啬啬恶寒，淅淅恶风，翕翕发热，鼻鸣干呕者，[桂枝汤]主之。__
* __大阳病，头痛发热，汗出恶风者，桂枝汤主之。__
* __大阳病，项背强几几，反汗出恶风者，[桂枝加葛根汤]主之。__
* __大阳病下之后。其气上冲者。可与桂枝汤^[方用前法，若不上冲者，不可与之]。__
* __大阳病三日，已发汗，若吐、若下、若温针，仍不解者，此为坏病^[桂枝不中与之也，观其脉证，知犯何逆，随证治之]。__
* 桂枝本为解肌，若其人脉浮紧，发热汗不出者，不可与之也，常须识此勿令误也。
    + 若酒客病，不可与桂枝汤，得汤则呕，以酒客不喜甘故也。
* 喘家，作桂枝汤，加厚朴杏子佳，又服桂枝汤吐者，其后必吐脓血也。
* __大阳病，发汗遂漏不止，其人恶风，小便难，四肢微急，难以屈伸者，[桂枝加附子汤]主之。__
* __大阳病下之后，脉促胸满者，[桂枝去芍药汤]主之；若微恶寒者，[桂枝去芍药加附子汤]主之。__
* __大阳病，得之八九日，如疟状，发热恶寒，热多寒少，其人不呕，清便欲自可，一日二三度发^[脉微缓者，为欲愈也，脉微而恶寒者，此阴阳俱虚，不可更发汗，更下、更吐也，面色反有热色者，未欲解也]。以其不能得少汗出，身必痒，宜桂枝麻黄各半汤。__
* __大阳病，初服桂枝汤，反烦不解者，先刺^[风池，风府]却与桂枝汤则愈。__
* __服桂枝汤，大汗出，脉洪大者，与桂枝汤，如前法。若形如疟，一日再发者，汗出必解，宜[桂枝二麻黄一汤]。__
* __服桂枝汤，大汗出后，大烦渴不解，脉洪大者，[白虎加人参汤]主之。__
* __大阳病，发热恶寒，热多寒少，脉微弱者，不可大发汗，宜[桂枝二越婢一汤]。服桂枝汤，或下之，仍头项强痛，翕翕发热，无汗心下满微痛，小便不利者，[桂枝去桂加茯苓白术汤]主之。__
* __伤寒脉浮，自汗出，小便数、心烦、微恶寒、脚挛急，反与桂枝汤，^[欲攻其表，此误也]得之便厥、咽中干、躁、吐逆者，作[甘草干姜汤]与之^[以复其阳]；若厥愈，足温者，更作[芍药甘草汤]与之；若胃气不和，谵语者，小与[调胃承气汤]，若重发汗，复加烧针，得之者，[回逆汤]主之。__
    + 问曰：证象阳旦，按法治之，而增剧，厥逆、咽中干燥、两胫拘急、而谵语。
    + 师曰：言夜半手足当温，两脚当伸。
    + 后如师言，何以知之？
    + 答曰：寸口脉浮而大，浮为风，大为虚。风则生微热，虚则两胫孪，病形象桂枝，因加附子参其间，增桂令汗出，附子温经，亡阳故也，厥逆、咽中干、烦躁，阳明内结，谵语烦乱，更饮甘草干姜汤，夜半阳气还，两足当热，胫尚微拘急，重与芍药甘草汤，尔乃胫伸，以承气汤微溏，则止其谵语故知病可愈。
[桂枝汤]: #
}
          recipe title:'桂枝汤' do
            ii title:'桂枝', qty:'三两', note:'去皮'
            ii title:'芍药', qty:'三两'
            ii title:'甘草', qty:'二两', note:'炙'
            ii title:'生姜', qty:'三两', note:'切'
            ii title:'大枣', qty:'十二枚', note:'擘'
            memo %q{右五味，㕮咀三味，以水七升，微火煮，取三升，去滓，适寒温，服一升。服已须臾，歠热稀粥一升余，以助药力，温覆令一时许，遍身漐漐，微似有汗者，益佳，不可令如水流离，病必不除。若一
服汗出病差，停后服，不必尽剂，若不汗，更服依前法，又不汗，后服小促其间，半日许，令三服尽，若病重者，一日一夜服，周时观之。

服一剂尽，病证犹在者，更作服，若汗不出，乃服之二三剂，禁生冷粘滑，肉面五辛，酒酪臭恶等物。}
          end
          recipe title:'桂枝加葛根汤' do
            ii title:'葛根', qty:'四两'
            ii title:'芍药', qty:'二两'
            ii title:'生姜', qty:'三两', note:'切'
            ii title:'甘草', qty:'二两', note:'炙'
            ii title:'大枣', qty:'十二枚', note:'擘'
            ii title:'桂枝', qty:'二两'
            memo %q{右六味，以水一斗，先煮葛根，减二升，去白沫，内诸药，煮取三升，去滓，温服一升，覆取微似汗，不须歠粥，余如桂枝法，将息及禁忌。}
          end
          recipe title:'桂枝加附子汤' do
            ii title:'桂枝', qty:'三两', note:'去皮'
            ii title:'芍药', qty:'三两'
            ii title:'甘草', qty:'三两', note:'炙'
            ii title:'生姜', qty:'三两', note:'切'
            ii title:'大枣', qty:'十二枚', note:'擘'
            ii title:'附子', qty:'一枚', note:'炮，去皮破八片'
            memo %q{右六味，以水七升，煮取三升，去滓，温服一升^[本云桂枝汤，今加附子]，将息如前法。}
          end
          recipe title:'桂枝去芍药汤' do
            ii title:'桂枝', qty:'二两', note:'去皮'
            ii title:'甘草', qty:'二两', note:'炙'
            ii title:'生姜', qty:'三两', note:'切'
            ii title:'大枣', qty:'十二枚', note:'擘'
            memo %q{右四味，以水七升，煮取三升，去滓，温服一升^[本云桂枝汤，今去芍药]，将息如前法。}
          end
          recipe title:'桂枝去芍药加附子汤' do
            ii title:'桂枝', qty:'二两', note:'去皮'
            ii title:'甘草', qty:'二两', note:'炙'
            ii title:'生姜', qty:'三两', note:'切'
            ii title:'大枣', qty:'十二枚', note:'擘'
            ii title:'附子', qty:'一枚', note:'炮，去皮破八片'
            memo %q{右五味，以水七升，煮取三升，去滓，温服一升^[本云桂枝汤，今去芍药，加附子]，将息如前法。}
          end
          recipe title:'桂枝麻黄各半汤' do
            ii title:'桂枝', qty:'一两十六铢', note:'去皮'
            ii title:'芍药', qty:'一两'
            ii title:'甘草', qty:'一两', note:'炙'
            ii title:'生姜', qty:'一两', note:'切'
            ii title:'麻黄', qty:'一两', note:'去节'
            ii title:'大枣', qty:'四枚', note:'擘'
            ii title:'杏仁', qty:'二十四枚', note:'汤渍去皮尖及两仁者'
            memo %q{右七味，以水五升，先煮麻黄一两沸，去上沫，内诸药，煮取一升八合去滓，温服六合^[本云桂枝汤三合，麻黄汤三合，并为六合]，顿服，将息如上法。}
          end
          recipe title:'桂枝二麻黄一汤' do
            ii title:'桂枝', qty:'一两十六铢', note:'去皮'
            ii title:'芍药', qty:'一两六铢'
            ii title:'麻黄', qty:'十六铢', note:'去节'
            ii title:'生姜', qty:'一两十六铢', note:'切'
            ii title:'杏仁', qty:'十六铢', note:'去皮尖'
            ii title:'甘草', qty:'一两二铢', note:'炙'
            ii title:'大枣', qty:'五枚', note:'擘'
            memo %q{右七味以水五升，先煮麻黄一二沸，去上沫，内诸药，煮取二升，去滓，温服一升，日再服^[本云桂枝汤二分，麻黄汤一分，合为二升，分再服，今合为方]，将息如上法。}
          end
          recipe title:'白虎加人参汤' do
            ii title:'知母', qty:'六两'
            ii title:'石膏', qty:'一斤', note:'碎，绵裹'
            ii title:'甘草', qty:'二两', note:'炙'
            ii title:'粳米', qty:'六合'
            ii title:'人参', qty:'三两'
            memo %q{右五味，以水一斗，煮米熟汤成，去滓，温服一升，日三服。}
          end
          recipe title:'桂枝二越婢一汤' do
            ii title:'桂枝', qty:'十八铢', note:'去皮'
            ii title:'芍药', qty:'十八铢'
            ii title:'麻黄', qty:'十八铢'
            ii title:'甘草', qty:'十八铢', note:'炙'
            ii title:'大枣', qty:'四枚', note:'擘'
            ii title:'生姜', qty:'一两二铢', note:'切'
            memo %q{右七味，以水五升，煮麻黄一二沸，去上沫，内诸药，煮取二升，去滓，温服一升^[本云，当裁为越婢汤、桂枝汤，合之饮一升，今合为一方，桂枝汤二分，越婢汤一分]。}
          end
          recipe title:'桂枝去桂加茯苓白术汤' do
            ii title:'芍药', qty:'三两'
            ii title:'甘草', qty:'二两', note:'炙'
            ii title:'生姜', qty:'三两', note:'切'
            ii title:'白术', qty:'三两'
            ii title:'茯苓', qty:'三两'
            ii title:'大枣', qty:'十二枚', note:'擘'
            memo %q{右六味，以水八升，煮取三升，去滓，温服一升，小便利则愈^[本云桂枝汤，今去桂枝加茯苓白术]。}
          end
          recipe title:'甘草干姜汤' do
            ii title:'甘草', qty:'四两', note:'炙'
            ii title:'干姜', qty:'二两'
            memo %q{上二味，以水三升，煮取一升五合，去滓，分温再服。}
          end
          recipe title:'芍药甘草汤' do
            ii title:'芍药', qty:'四两'
            ii title:'甘草', qty:'四两', note:'炙'
            memo %q{右二味，以水三升，煮取一升五合，去滓,分温再服。}
          end
          recipe title:'调胃承气汤' do
            ii title:'芒硝', qty:'半升'
            ii title:'甘草', qty:'二两', note:'炙'
            ii title:'大黄', qty:'四两', note:'去皮清酒洗'
            memo %q{右三味，以水三升，煮取一升，去滓，纳芒消，更煮一两沸，顿服。}
          end
          recipe title:'回逆汤' do
            ii title:'甘草', qty:'二两', note:'炙'
            ii title:'干姜', qty:'一两半'
            ii title:'附子', qty:'一枚', note:'生用，去皮，破八片'
            memo %q{右三味，以水三升，煮取一升二合，去滓，分温再服。强人可大附子一枚，干姜三两。}
          end
          p content
        end
        article title:'辨大阳病结胸'
        article title:'辨阳明病'
        article title:'辨少阳病'
        article title:'辨大阴病'
        article title:'辨少阴病'
        article title:'辨厥阴病'
        article title:'辨厥阴病霍乱'
        article title:'辨阴阳易差后劳复病'
      end

    end
  end
end
